pradeepa-s/sdcard_library/example/tms570ls11x _safeti/CCS/sdcard_test/HALCoGen/source/sys_startup.c
	/* Run PBIST on STC ROM */
    pbistRun((uint32)STC_ROM_PBIST_RAM_GROUP,
             ((uint32)PBIST_TripleReadSlow | (uint32)PBIST_TripleReadFast));
    
    /* Wait for PBIST for STC ROM to be completed */
    /*SAFETYMCUSW 28 D MR:NA <APPROVED> "Hardware status bit read check" */
    while(pbistIsTestCompleted() != TRUE)
    { 
    }/* Wait */ 
    
    /* Check if PBIST on STC ROM passed the self-test */
    if( pbistIsTestPassed() != TRUE)
    {
        /* PBIST and STC ROM failed the self-test.
         * Need custom handler to check the memory failure
         * and to take the appropriate next step.
         */
         
        pbistFail();

    }   
	
    /* Disable PBIST clocks and disable memory self-test mode */
    pbistStop();

	/* Run PBIST on PBIST ROM */
    pbistRun((uint32)PBIST_ROM_PBIST_RAM_GROUP,
             ((uint32)PBIST_TripleReadSlow | (uint32)PBIST_TripleReadFast));
    
    /* Wait for PBIST for PBIST ROM to be completed */
    /*SAFETYMCUSW 28 D MR:NA <APPROVED> "Hardware status bit read check" */
    while(pbistIsTestCompleted() != TRUE)
    { 
    }/* Wait */ 
    
    /* Check if PBIST ROM passed the self-test */
    if( pbistIsTestPassed() != TRUE)
    {
        /* PBIST and STC ROM failed the self-test.
         * Need custom handler to check the memory failure
         * and to take the appropriate next step.
         */
         
        pbistFail();

    } 
	
    /* Disable PBIST clocks and disable memory self-test mode */
    pbistStop();	
/* USER CODE BEGIN (27) */
/* USER CODE END */

    /* Make sure that the CPU self-test controller can actually detect a fault inside CPU */
    stcSelfCheck();

/* USER CODE BEGIN (28) */
#else
    /* Initialize System - Clock, Flash settings with Efuse self check */
    systemInit();

#ifndef DEBUG_MODE
    if(RESET_TYPE_DEBUG != resetReason){
    	/* THIS WILL BE REPLACED BY HALCOGEN */
		stcSelfTestConfig.stcClockDiv = 0;
		stcSelfTestConfig.intervalCount = 1;
		stcSelfTestConfig.restartInterval0 = TRUE;
		stcSelfTestConfig.timeoutCounter = 0xFFFFFFFF;
		_SL_HoldNClear_nError();
		SL_SelfTest_STC(STC_COMPARE_SELFCHECK, TRUE, &stcSelfTestConfig);

    }
    else{
    	afterSTC();
    }
#endif
    afterSTC();
#endif
/* USER CODE END */
}

void afterSTC(void)
{
/* USER CODE BEGIN (29) */
#ifdef SAFETI_INTEGRATE
#ifndef DEBUG_MODE
	SL_CCMR4F_FailInfo			failInfoCCMR4F;		/* CCMR4 Self Test fail info */
#endif
	volatile boolean 			retVal;             /* For function return values */
	SL_PBIST_FailInfo           failInfoPBISTSRAM;  /* PBIST Failure information for TCM RAM */
	SL_SelfTest_Result          failInfoFlash;      /* Flash Self test failure information */
	SL_SelfTest_Result          failInfoTCMRAM;     /* TCM RAM Failure  information */
	SL_PBIST_FailInfo           failInfoPBISTOthers;/* PBIST Failure information for non-TCM memories */
	SL_PSCON_FailInfo           failInfoPSCON;      /* PSCON failure information */
	SL_EFuse_Config             stConfigEFuse;      /* EFuse self test configuration */
#endif

#ifndef SAFETI_INTEGRATE
/* USER CODE END */

    /* Make sure that CCM-R4F is working as expected.
     * This function puts the CCM-R4F module through its self-test modes.
     * It ensures that the CCM-R4F is indeed capable of detecting a CPU mismatch,
     * and is also capable of indicating a mismatch error to the ESM.
     */
    ccmSelfCheck();

/* USER CODE BEGIN (30) */
#endif
/* USER CODE END */

/* USER CODE BEGIN (31) */
#ifndef SAFETI_INTEGRATE
/* USER CODE END */

    /* Disable RAM ECC before doing PBIST for Main RAM */
    _coreDisableRamEcc_();

    /* Run PBIST on CPU RAM.
     * The PBIST controller needs to be configured separately for single-port and dual-port SRAMs.
     * The CPU RAM is a single-port memory. The actual "RAM Group" for all on-chip SRAMs is defined in the
     * device datasheet.
     */
    pbistRun(0x00300020U, /* ESRAM Single Port PBIST */
             (uint32)PBIST_March13N_SP);

/* USER CODE BEGIN (32) */
/* USER CODE END */

    /* Wait for PBIST for CPU RAM to be completed */
    /*SAFETYMCUSW 28 D MR:NA <APPROVED> "Hardware status bit read check" */
    while(pbistIsTestCompleted() != TRUE)
    {
    }/* Wait */


/* USER CODE BEGIN (33) */
/* USER CODE END */

    /* Check if CPU RAM passed the self-test */
    if( pbistIsTestPassed() != TRUE)
    {
        /* CPU RAM failed the self-test.
         * Need custom handler to check the memory failure
         * and to take the appropriate next step.
         */
/* USER CODE BEGIN (34) */
/* USER CODE END */

        pbistFail();

/* USER CODE BEGIN (35) */
/* USER CODE END */
    }

/* USER CODE BEGIN (36) */
/* USER CODE END */

    /* Disable PBIST clocks and disable memory self-test mode */
    pbistStop();


/* USER CODE BEGIN (37) */
#else
    /* Execute PBIST tests on required peripheral SRAMs */
    _SL_HoldNClear_nError();
    retVal = SL_SelfTest_PBIST(PBIST_EXECUTE, PBIST_RAMGROUP_01_PBIST_ROM, PBISTALGO_TRIPLE_READ_FAST_READ);

    while(TRUE != SL_SelfTest_WaitCompletion_PBIST());

    SL_SelfTest_Status_PBIST(&failInfoPBISTSRAM);
	if (failInfoPBISTSRAM.stResult != ST_PASS)
	{
		while(1);
	}

	/* Run a diagnostic check on the memory self-test controller.
	 * This function chooses a RAM test algorithm and runs it on an on-chip ROM.
	 * The memory self-test is expected to fail. The function ensures that the PBIST controller
	 * is capable of detecting and indicating a memory self-test failure.
	 */

	/* Run PBIST on CPU RAM.
	 * The PBIST controller needs to be configured separately for single-port and dual-port SRAMs.
	 * The CPU RAM is a single-port memory. The actual "RAM Group" for all on-chip SRAMs is defined in the
	 * device datasheet.
	 */
	retVal = SL_SelfTest_PBIST(	PBIST_EXECUTE,                                          /* Execute PBIST test */
								(PBIST_RAMGROUP_06_ESRAM1 | PBIST_RAMGROUP_21_ESRAM5),   /* On all TCM RAMs */
								PBISTALGO_MARCH13N_RED_1PORT);
	while (TRUE != SL_SelfTest_WaitCompletion_PBIST());

	/* Get SRAM PBIST Status */
	SL_SelfTest_Status_PBIST(&failInfoPBISTSRAM);
	if (failInfoPBISTSRAM.stResult != ST_PASS)
	{
		while(1);
	}

	/* Disable PBIST clocks and disable memory self-test mode */
	SL_SelfTest_PBIST_StopExec();
#endif

